const hangul_to_hiragana_dict = {
    '캿': 'きゃっ', '큣': 'きゅっ', '쿗': 'きょっ', '캰': 'きゃん', '큔': 'きゅん', '쿈': 'きょん', '컁': 'きゃん', '큥': 'きゅん', '쿙': 'きょん', 
    '꺗': 'きゃっ', '뀻': 'きゅっ', '꾯': 'きょっ', '꺈': 'きゃん', '뀬': 'きゅん', '꾠': 'きょん', '꺙': 'きゃん', '뀽': 'きゅん', '꾱': 'きょん', 
    '샷': 'しゃっ', '슛': 'しゅっ', '숏': 'しょっ', '샨': 'しゃん', '슌': 'しゅん', '숀': 'しょん', '샹': 'しゃん', '슝': 'しゅん', '숑': 'しょん', 
    '챳': 'ちゃっ', '츗': 'ちゅっ', '춋': 'ちょっ', '챤': 'ちゃん', '츈': 'ちゅん', '쵼': 'ちょん', '챵': 'ちゃん', '츙': 'ちゅん', '춍': 'ちょん', 
    '쨧': 'ちゃっ', '쯋': 'ちゅっ', '쬿': 'ちょっ', '쨘': 'ちゃん', '쮼': 'ちゅん', '쬰': 'ちょん', '쨩': 'ちゃん', '쯍': 'ちゅん', '쭁': 'ちょん', 
    '냣': 'にゃん', '늇': 'にゅっ', '뇻': 'にょっ', '냔': 'にゃん','뉸': 'にゅん', '뇬': 'にょん', '냥': 'にゃん','늉': 'にゅん', '뇽': 'にょん', 
    '햣': 'ひゃっ', '흇': 'ひゅっ', '횻': 'ひょっ', '햔': 'ひゃん', '휸': 'ひゅん', '횬': 'ひょん', '향': 'ひゃん', '흉': 'ひゅん', '횽': 'ひょん', 
    '먓': 'みゃっ', '뮷': 'みゅっ', '묫': 'みょっ', '먄': 'みゃん', '뮨': 'みゅん', '묜': 'みょん', '먕': 'みゃん', '뮹': 'みゅん', '묭': 'みょん', 
    '럇': 'りゃっ', '륫': 'りゅっ', '룟': 'りょっ', '랸': 'りゃん', '륜': 'りゅん', '룐': 'りょん', '량': 'りゃん', '륭': 'りゅん', '룡': 'りょん', 
    '걋': 'ぎゃっ', '귯': 'ぎゅっ', '굣': 'ぎょっ', '갼': 'ぎゃん', '균': 'ぎゅん', '굔': 'ぎょん', '걍': 'ぎゃん', '귱': 'ぎゅん', '굥': 'ぎょん', 
    '쟛': 'じゃっ', '쥿': 'じゅっ', '죳': 'じょっ', '쟌': 'じゃん', '쥰': 'じゅん', '죤': 'じょん', '쟝': 'じゃん', '즁': 'じゅん', '죵': 'じょん', 
    '댯': 'ぢゃっ', '듓': 'ぢゅっ', '둇': 'ぢょっ', '댠': 'ぢゃん', '듄': 'ぢゅん', '됸': 'ぢょん', '댱': 'ぢゃん', '듕': 'ぢゅん', '둉': 'ぢょん', 
    '뱟': 'びゃっ', '븃': 'びゅっ', '뵷': 'びょっ', '뱐': 'びゃん', '뷴': 'びゅん', '뵨': 'びょん', '뱡': 'びゃん', '븅': 'びゅん', '뵹': 'びょん', 
    '퍗': 'ぴゃっ', '퓻': 'ぴゅっ', '푯': 'ぴょっ', '퍈': 'ぴゃん', '퓬': 'ぴゅん', '푠': 'ぴょん', '퍙': 'ぴゃん', '퓽': 'ぴゅん', '푱': 'ぴょん', 
    '뺫': 'ぴゃっ', '쁏': 'ぴゅっ', '뿃': 'ぴょっ', '뺜': 'ぴゃん', '쁀': 'ぴゅん', '뾴': 'ぴょん', '뺭': 'ぴゃん', '쁑': 'ぴゅん', '뿅': 'ぴょん', 

    '앗': 'あっ','잇': 'いっ', '웃': 'うっ','읏': 'うっ', '엣': 'えっ', '옷': 'おっ', '옵': 'おっ', 
    '캇': 'かっ','킷': 'かっ', '쿳': 'くっ','큿': 'くっ', '켓': 'けっ', '콧': 'こっ', '콥': 'こっ', 
    '깟': 'かっ','낏': 'かっ', '꿋': 'くっ','끗': 'くっ', '껫': 'けっ', '꼿': 'こっ', '꼽': 'こっ', 
    '삿': 'さっ','싯': 'しっ', '숫': 'すっ','슷': 'すっ', '셋': 'せっ', '솟': 'そっ', '솝': 'そっ', 
    '탓': 'たっ','칫': 'ちっ', '춧': 'つっ','츳': 'つっ', '텟': 'てっ', '톳': 'とっ', '톱': 'とっ', 
    '땃': 'たっ','찟': 'ちっ', '쭛': 'つっ','쯧': 'つっ', '뗏': 'てっ', '똣': 'とっ', '똡': 'とっ', 
    '낫': 'なっ','닛': 'にっ', '눗': 'ぬっ','늣': 'ぬっ', '넷': 'ねっ', '놋': 'のっ', '놉': 'のっ', 
    '핫': 'はっ','힛': 'ひっ', '훗': 'ふっ','흣': 'ふっ', '헷': 'へっ', '홋': 'ほっ', '훕': 'ほっ', 
    '맛': 'まっ','밋': 'みっ', '뭇': 'むっ','믓': 'むっ', '멧': 'めっ', '못': 'もっ', '뭅': 'もっ', 
    '랏': 'らっ','릿': 'りっ', '룻': 'るっ','릇': 'るっ', '렛': 'れっ', '롯': 'ろっ', '룹': 'ろっ', 
    '갓': 'がっ','깃': 'ぎっ', '굿': 'ぐっ','긋': 'ぐっ', '겟': 'げっ', '곳': 'ごっ', '곱': 'ごっ', 
    '잣': 'ざっ','짓': 'じっ', '줏': 'ずっ','즛': 'ずっ', '젯': 'ぜっ', '좃': 'ぞっ', '좁': 'ぞっ', 
    '닷': 'だっ','딧': 'ぢっ', '둣': 'づっ','듯': 'づっ', '뎃': 'でっ', '돗': 'どっ', '돕': 'どっ', 
    '밧': 'ばっ','빗': 'びっ', '붓': 'ぶっ','븟': 'ぶっ', '벳': 'べっ', '봇': 'ぼっ', '봅': 'ぼっ', 
    '팟': 'ぱっ','핏': 'ぴっ', '풋': 'ぷっ','픗': 'ぷっ', '펫': 'ぺっ', '폿': 'ぽっ', '폽': 'ぽっ', 
    '빳': 'ぱっ','삣': 'ぴっ', '뿟': 'ぷっ','쁫': 'ぷっ', '뻿': 'ぺっ', '뽓': 'ぽっ', '뽑': 'ぽっ', 
    '얏': 'やっ', '윳': 'ゆっ', '욧': 'よっ', '왓': 'わっ', 

    '안': 'あん','인': 'いん','운': 'うん','은': 'うん','엔': 'えん','온': 'おん',
    '앙': 'あん','잉': 'いん','웅': 'うん',            '엥': 'えん','옹': 'おん', 
    '칸': 'かん','킨': 'きん','쿤': 'くん','큰': 'くん','켄': 'けん', '콘': 'こん', 
    '캉': 'かん','킹': 'きん','쿵': 'くん','킁': 'くん','켕': 'けん', '콩': 'こん', 
    '깐': 'かん','낀': 'きん','꾼': 'くん','끈': 'くん','껜': 'けん', '꼰': 'こん', 
    '깡': 'かん','낑': 'きん','꿍': 'くん','끙': 'くん','껭': 'けん', '꽁': 'こん', 
    '산': 'さん', '신': 'しん', '순': 'すん','슨': 'すん', '센': 'せん', '손': 'そん', 
    '상': 'さん', '싱': 'しん', '숭': 'すん','승': 'すん', '셍': 'せん', '송': 'そん', 
    '탄': 'たん', '친': 'ちん', '춘': 'つん','츤': 'つん', '텐': 'てん', '톤': 'とん', 
    '탕': 'たん', '칭': 'ちん', '충': 'つん','층': 'つん', '텡': 'てん', '통': 'とん', 
    '딴': 'たん', '찐': 'ちん', '쭌': 'つん','쯘': 'つん', '뗀': 'てん', '똔': 'とん', 
    '땅': 'たん', '찡': 'ちん', '쭝': 'つん','쯩': 'つん', '뗑': 'てん', '똥': 'とん', 
    '난': 'なん', '닌': 'にん', '눈': 'ぬん','는': 'ぬん', '넨': 'ねん', '논': 'のん', 
    '낭': 'なん', '닝': 'にん', '눙': 'ぬん','능': 'ぬん', '넹': 'ねん', '농': 'のん', 
    '한': 'はん', '힌': 'ひん', '훈': 'ふん','흔': 'ふん', '헨': 'へん', '혼': 'ほん', 
    '항': 'はん', '힝': 'ひん', '훙': 'ふん','흥': 'ふん', '헹': 'へん', '홍': 'ほん', 
    '만': 'まん', '민': 'みん', '문': 'むん','믄': 'むん', '멘': 'めん', '몬': 'もん', 
    '망': 'まん', '밍': 'みん', '뭉': 'むん','믕': 'むん', '멩': 'めん', '몽': 'もん', 
    '란': 'らん', '린': 'りん', '룬': 'るん','른': 'るん', '렌': 'れん', '론': 'ろん', 
    '랑': 'らん', '링': 'りん', '룽': 'るん','릉': 'るん', '렝': 'れん', '롱': 'ろん', 
    '간': 'がん', '긴': 'ぎん', '군': 'ぐん','근': 'ぐん', '겐': 'げん', '곤': 'ごん', 
    '강': 'がん', '깅': 'ぎん', '궁': 'ぐん','긍': 'ぐん', '겡': 'げん', '공': 'ごん', 
    '잔': 'ざん', '진': 'じん', '준': 'ずん','즌': 'ずん', '젠': 'ぜん', '존': 'ぞん', 
    '장': 'ざん', '징': 'じん', '중': 'ずん','증': 'ずん', '젱': 'ぜん', '종': 'ぞん', 
    '단': 'だん', '딘': 'ぢん', '둔': 'づん','든': 'づん', '덴': 'でん', '돈': 'どん', 
    '당': 'だん', '딩': 'ぢん', '둥': 'づん','등': 'づん', '뎅': 'でん', '동': 'どん', 
    '반': 'ばん', '빈': 'びん', '분': 'ぶん','븐': 'ぶん', '벤': 'べん', '본': 'ぼん', 
    '방': 'ばん', '빙': 'びん', '붕': 'ぶん','븡': 'ぶん', '벵': 'べん', '봉': 'ぼん', 
    '판': 'ぱん', '핀': 'ぴん', '푼': 'ぷん','픈': 'ぷん', '펜': 'ぺん', '폰': 'ぽん', 
    '팡': 'ぱん', '핑': 'ぴん', '풍': 'ぷん','픙': 'ぷん', '펭': 'ぺん', '퐁': 'ぽん', 
    '빤': 'ぱん', '삔': 'ぴん', '뿐': 'ぷん','쁜': 'ぷん', '뻰': 'ぺん', '뽄': 'ぽん', 
    '빵': 'ぱん', '삥': 'ぴん', '뿡': 'ぷん','쁭': 'ぷん', '뼁': 'ぺん', '뽕': 'ぽん', 
    '얀': 'やん', '윤': 'ゆん', '욘': 'よん', '완': 'ウァン',
    '양': 'やん', '융': 'ゆん', '용': 'よん', '왕': 'ウァン',

    '켸': 'きぇ', '캬': 'きゃ', '큐': 'きゅ', '쿄': 'きょ', 
    '셰': 'しぇ', '샤': 'しゃ', '슈': 'しゅ', '쇼': 'しょ', 
    '쳬': 'ちぇ', '챠': 'ちゃ', '츄': 'ちゅ', '쵸': 'ちょ', 
    '녜': 'にぇ', '냐': 'にゃ', '뉴': 'にゅ', '뇨': 'にょ', 
    '혜': 'ひぇ', '햐': 'ひゃ', '휴': 'ひゅ', '효': 'ひょ', 
    '몌': 'みぇ', '먀': 'みゃ', '뮤': 'みゅ', '묘': 'みょ', 
    '례': 'りぇ', '랴': 'りゃ', '류': 'りゅ', '료': 'りょ', 
    '계': 'ぎぇ', '갸': 'ぎゃ', '규': 'ぎゅ', '교': 'ぎょ', 
    '졔': 'じぇ', '쟈': 'じゃ', '쥬': 'じゅ', '죠': 'じょ', 
    '뎨': 'ぢぇ', '댜': 'ぢゃ', '듀': 'ぢゅ', '됴': 'ぢょ', 
    '볘': 'びぇ', '뱌': 'びゃ', '뷰': 'びゅ', '뵤': 'びょ', 
    '폐': 'ぴぇ', '퍄': 'ぴゃ', '퓨': 'ぴゅ', '표': 'ぴょ', 


                 '위': 'うぃ','웨': 'うぇ','워': 'うぉ',
    '콰': 'くぁ','퀴': 'くぃ','퀘': 'くぇ','쿼': 'くぉ',
    '꽈': 'くぁ','뀌': 'くぃ','꿰': 'くぇ','꿔': 'くぉ',
    '솨': 'すぁ','쉬': 'すぃ','쉐': 'すぇ','숴': 'すぉ',
    '촤': 'つぁ','취': 'つぃ','췌': 'つぇ','춰': 'つぉ',
    '쫘': 'つぁ','쮜': 'つぃ','쮀': 'つぇ','쭤': 'つぉ',
    '놔': 'ぬぁ','뉘': 'ぬぃ','눼': 'ぬぇ','눠': 'ぬぉ',
    '화': 'ふぁ','휘': 'ふぃ','훼': 'ふぇ','훠': 'ふぉ',
    '뫄': 'むぁ','뮈': 'むぃ','뭬': 'むぇ','뭐': 'むぉ',
    '롸': 'るぁ','뤼': 'るぃ','뤠': 'るぇ','뤄': 'るぉ',
    '과': 'ぐぁ','귀': 'ぐぃ','궤': 'ぐぇ','궈': 'ぐぉ',
    '좌': 'ずぁ','쥐': 'ずぃ','줴': 'ずぇ','줘': 'ずぉ',
    '돠': 'づぁ','뒤': 'づぃ','뒈': 'づぇ','둬': 'づぉ',
    '봐': 'ぶぁ','뷔': 'ぶぃ','붸': 'ぶぇ','붜': 'ぶぉ',
    '퐈': 'ぷぁ','퓌': 'ぷぃ','풰': 'ぷぇ','풔': 'ぷぉ',
    '뽜': 'ぷぁ','쀠': 'ぷぃ','쀄': 'ぷぇ','뿨': 'ぷぉ',


    '아': 'あ', '이': 'い', '우': 'う','으': 'う', '에': 'え', '오': 'お', 
    '카': 'か', '키': 'き', '쿠': 'く','크': 'く', '케': 'け', '코': 'こ', 
    '까': 'か', '끼': 'き', '꾸': 'く','끄': 'く', '께': 'け', '꼬': 'こ', 
    '사': 'さ', '시': 'し', '수': 'す','스': 'す', '세': 'せ', '소': 'そ', 
    '타': 'た', '치': 'ち', '추': 'つ','츠': 'つ', '테': 'て', '토': 'と', 
    '따': 'た', '찌': 'ち', '쭈': 'つ','쯔': 'つ', '떼': 'て', '또': 'と', 
    '나': 'な', '니': 'に', '누': 'ぬ','느': 'ぬ', '네': 'ね', '노': 'の', 
    '하': 'は', '히': 'ひ', '후': 'ふ','흐': 'ふ', '헤': 'へ', '호': 'ほ', 
    '마': 'ま', '미': 'み', '무': 'む','므': 'む', '메': 'め', '모': 'も', 
    '라': 'ら', '리': 'り', '루': 'る','르': 'る', '레': 'れ', '로': 'ろ', 
    '가': 'が', '기': 'ぎ', '구': 'ぐ','그': 'ぐ', '게': 'げ', '고': 'ご', 
    '자': 'ざ', '지': 'じ', '주': 'ず','즈': 'ず', '제': 'ぜ', '조': 'ぞ', 
    '다': 'だ', '디': 'ぢ', '두': 'づ','드': 'づ', '데': 'で', '도': 'ど', 
    '바': 'ば', '비': 'び', '부': 'ぶ','브': 'ぶ', '베': 'べ', '보': 'ぼ', 
    '파': 'ぱ', '피': 'ぴ', '푸': 'ぷ','프': 'ぷ', '페': 'ぺ', '포': 'ぽ',
    '빠': 'ぱ', '삐': 'ぴ', '뿌': 'ぷ','쁘': 'ぷ', '뻬': 'ぺ', '뽀': 'ぽ',
    '야': 'や', '유': 'ゆ', '요': 'よ', 
    '와': 'わ', '응': 'ん', 
}

export function to_hiragana(hangul){
    let hiragana = ''
    for(let i = 0; i < hangul.length; i++){
        if(hangul[i] in hangul_to_hiragana_dict){
            if (hangul[i] === '오' && hangul[i+1] === ' ') {
                hiragana += 'を'
                i++
            } else {
                hiragana += hangul_to_hiragana_dict[hangul[i]]
            }
        }
        else{
            hiragana += hangul[i]        
        }
    }
    return hiragana
}

